# Python | Pandas.apply()

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("C:/Users/rahul/Downloads/nba.csv")

In [4]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [5]:
df["Weight"].describe()

count    457.000000
mean     221.522976
std       26.368343
min      161.000000
25%      200.000000
50%      220.000000
75%      240.000000
max      307.000000
Name: Weight, dtype: float64

In [18]:
data = pd.DataFrame()
data["Weight"] = df["Weight"]
data

     Weight
0     180.0
1     235.0
2     205.0
3     185.0
4     231.0
..      ...
453   203.0
454   179.0
455   256.0
456   231.0
457     NaN

[458 rows x 1 columns]

In [16]:
def fun(num):
    if num<200:
        return "Low"
    
    elif num >= 200 and num <250:
       return "Medium"
    else:
       return "high"

In [19]:
new = data["Weight"].apply(fun)

In [21]:
new.head(10)

0       Low
1    Medium
2    Medium
3       Low
4    Medium
5    Medium
6    Medium
7    Medium
8       Low
9    Medium
Name: Weight, dtype: object

In [25]:
print(df["Name"].head,"\n",new.tail(10))

<bound method NDFrame.head of 0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object>
 448    Medium
449    Medium
450    Medium
451    Medium
452    Medium
453    Medium
454       Low
455      high
456    Medium
457      high
Name: Weight, dtype: object

# Apply function to every row in a Pandas DataFrame

In [29]:
import numpy as np
data =  {
    'A': [1,3,7],
    'B': [2,5,6],
    'C' : [4,7,9]}
df = pd.DataFrame(data)

In [27]:
df

   A  B  C
0  1  2  4
1  3  5  7
2  7  6  9

In [34]:
df["add"] = df.apply(np.sum,axis =1)
df

   A  B  C   add
0  1  2  4   7.0
1  3  5  7  15.0
2  7  6  9  22.0

In [45]:

def normalize(x, y):
    x_new = ((x - np.mean([x, y])) /
             (max(x, y) - min(x, y)))
 
    # print(x_new)
    return x_new
 
# create a dictionary with three fields each
data = {
        'X': [1, 2, 3],
        'Y': [45, 65, 89]}
 
    # Convert the dictionary into DataFrame
df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

Original DataFrame:
    X   Y
0  1  45
1  2  65
2  3  89

In [48]:
df["X"] = df.apply(lambda row : normalize(row['X'],row['Y']),axis=1)
df

     X   Y   Normalized X
0 -0.5  45           -0.5
1 -0.5  65           -0.5
2 -0.5  89           -0.5

lambda row: creates a lambda function that takes each row of the DataFrame as input.
row['X'] and row['Y'] access the values of columns 'X' and 'Y' for each row

# Python | Pandas dataframe.aggregate()

Dataframe.aggregate() function is used to apply some aggregation across one or more columns. Aggregate using callable, string, dict, or list of string/callables. The most frequently used aggregations are:

sum: Return the sum of the values for the requested axis
min: Return the minimum of the values for the requested axis
max: Return the maximum of the values for the requested axis

In [50]:
df = pd.read_csv("C:/Users/rahul/Downloads/nba.csv")

In [51]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [56]:
df.aggregate({"Number":['sum', 'min'], 
              "Age":['max', 'min'], 
              "Weight":['min', 'sum'],  
              "Salary":['sum']})

     Number   Age    Weight        Salary
sum  8079.0   NaN  101236.0  2.159837e+09
min     0.0  19.0     161.0           NaN
max     NaN  40.0       NaN           NaN

# Pandas dataframe.mean() function returns the mean of the values for the requested axis.

In [57]:
df = pd.DataFrame({"A":[12, 4, 5, 44, 1], 
                "B":[5, 2, 54, 3, 2], 
                "C":[20, 16, 7, 3, 8], 
                "D":[14, 3, 17, 2, 6]})

In [58]:
df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [60]:
df.mean(axis=0)

A    13.2
B    13.2
C    10.8
D     8.4
dtype: float64

In [62]:
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, None, 1], 
                "B":[7, 2, 54, 3, None], 
                "C":[20, 16, 11, 3, 8], 
                "D":[14, 3, None, 2, 6]}) 
  
# skip the Na values while finding the mean 
df.mean(axis = 1, skipna = True)

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64